app/views/tipo_servicios/_form.html.erb

                          <div class="col-sm-3">
                              <%= check_box_tag('estado_civiles[]', estado_civil.id, @tipo_servicio.estado_civiles.include?(estado_civil)) %> <%= estado_civil.descripcion %>
---
SELECT "estado_civiles".* FROM "estado_civiles"

                          <div class="col-sm-3">
                            <%= check_box_tag('ocupaciones[]', ocupacion.id, @tipo_servicio.ocupaciones.include?(ocupacion)) %> <%= ocupacion.descripcion %>
---
SELECT "ocupaciones".* FROM "ocupaciones"

                          <div class="col-sm-3">
                            <%= check_box_tag('profesions[]', profesion.id, @tipo_servicio.profesiones.include?(profesion)) %> <%= profesion.descripcion %>
---
SELECT "profesiones".* FROM "profesiones"

                          <div class="col-sm-3">
                            <%= check_box_tag('sexos[]', sexo.id, @tipo_servicio.sexos.include?(sexo)) %> <%= sexo.descripcion %>
---
SELECT "sexos".* FROM "sexos"

                          <div class="col-sm-3">
                            <%= check_box_tag('cirugias[]', cirugia.id, @tipo_servicio.cirugias.include?(cirugia)) %> <%= cirugia.descripcion %>
---
SELECT "cirugias".* FROM "cirugias"

                          <div class="col-sm-3 ">
                            <%= check_box_tag('discapacidades[]', discapacidad.id, @tipo_servicio.discapacidades.include?(discapacidad)) %> <%= discapacidad.descripcion %>
---
SELECT "discapacidades".* FROM "discapacidades"

                          <div class="col-sm-3">
                            <%= check_box_tag('grupo_sanguineos[]', grupo_sanguineo.id, @tipo_servicio.grupo_sanguineos.include?(grupo_sanguineo)) %> <%= grupo_sanguineo.descripcion %>
---
SELECT "grupo_sanguineos".* FROM "grupo_sanguineos"

                          <div class="col-sm-3">
                            <%= check_box_tag('lesiones[]', lesion.id, @tipo_servicio.lesiones.include?(lesion)) %> <%= lesion.descripcion %>
---
SELECT "lesiones".* FROM "lesiones"

                          <div class="col-sm-3">
                            <%= check_box_tag('patologias[]', patologia.id, @tipo_servicio.patologias.include?(patologia)) %> <%= patologia.descripcion %>
---
SELECT "patologias".* FROM "patologias"

                          <div class="col-sm-3">
                            <%= check_box_tag('vacunas[]', vacuna.id, @tipo_servicio.vacunas.include?(vacuna)) %> <%= vacuna.descripcion %>
---
SELECT "vacunas".* FROM "vacunas"

                          <div class="col-sm-3">
                            <%= check_box_tag('adicciones[]', adiccion.id, @tipo_servicio.adicciones.include?(adiccion)) %> <%= adiccion.descripcion %>
---
SELECT "adicciones".* FROM "adicciones"

                          <div class="col-sm-3">
                            <%= check_box_tag('habitos[]', habito.id, @tipo_servicio.habitos.include?(habito)) %> <%= habito.descripcion %>
---
SELECT "habitos".* FROM "habitos"