app/controllers/agenda_servicio_controller.rb

SELECT  "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "citas".* FROM "citas" LEFT OUTER JOIN "turnos" ON "turnos"."id" = "citas"."turno_id" LEFT OUTER JOIN "horarios" ON "horarios"."id" = "turnos"."horario_id" LEFT OUTER JOIN "servicios" ON "servicios"."horario_id" = "horarios"."id" WHERE (turno.horario.servicio.id = 1)
---
  def detalle
    @servicio = Servicio.find_by_id(params[:id])

    @items = []

    citas = Cita.left_outer_joins(turno: {horario: :servicio}).where("turno.horario.servicio.id = ?", @servicio.id)