app/controllers/especialistas_controller.rb

  def index
    @especialistas = Especialista.all
---
SELECT "especialistas".* FROM "especialistas"

  def show
    @especialista = Especialista.find(params[:id])
---
SELECT  "especialistas".* FROM "especialistas" WHERE "especialistas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @especialista = Especialista.new
    @persona = Persona.new
    @especialidades = Especialidad.all
    @universidades = Universidad.all
    @formacion_academicas = FormacionAcademica.all
    @sexos = Sexo.all
---
SELECT "formacion_academicas".* FROM "formacion_academicas"
SELECT "sexos".* FROM "sexos"

  def edit
    @especialista = Especialista.find(params[:id])
    @persona = @especialista.persona
    @especialidades = Especialidad.all
    @universidades = Universidad.all
    @formacion_academicas = FormacionAcademica.all
    @sexos = Sexo.all
---
SELECT  "especialistas".* FROM "especialistas" WHERE "especialistas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "formacion_academicas".* FROM "formacion_academicas"
SELECT "sexos".* FROM "sexos"

  def create
    @especialista = Especialista.new(especialista_params)
    @persona = Persona.new(persona_params)



    respond_to do |format|
      if @persona.save
        @especialista.persona_id = @persona.id
        @especialista.save
---
INSERT INTO "personas" ("cedula", "nombre", "apellido", "telefono", "direccion", "fecha_nacimiento", "sexo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "especialistas" ("especialidad_id", "persona_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["especialidad_id", 1], ["persona_id", 2], ["created_at", 2017-02-28 00:41:45 UTC], ["updated_at", 2017-02-28 00:41:45 UTC]]

  def update
    respond_to do |format|
      if @especialista.update(especialista_params)
---
UPDATE "especialistas" SET "especialidad_id" = $1, "updated_at" = $2 WHERE "especialistas"."id" = $3  [["especialidad_id", 12], ["updated_at", 2017-02-28 06:06:44 UTC], ["id", 1]]

    def set_especialista
      @especialista = Especialista.find(params[:id])
---
SELECT  "especialistas".* FROM "especialistas" WHERE "especialistas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]