app/controllers/habitos_controller.rb

SELECT "habitos".* FROM "habitos"
---
  def index
    @parametros = Habito.all