app/controllers/horarios_controller.rb

SELECT "horarios".* FROM "horarios"
---
  def index
    @horarios = Horario.all

SELECT "tipo_horarios".* FROM "tipo_horarios"
---
  def new

    @horario = Horario.new
    @collection = TipoHorario.all