app/controllers/informacion_generals_controller.rb

    def set_informacion_general
      @informacion_general = InformacionGeneral.find(params[:id])
---
SELECT  "informacion_generals".* FROM "informacion_generals" WHERE "informacion_generals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]