app/controllers/noticias_controller.rb

SELECT "noticias".* FROM "noticias"
---
  def index
    if params[:id].nil?
      @parametros = Noticia.all

SELECT "tipo_noticias".* FROM "tipo_noticias"
---
  def show
    @tipoNoticias = TipoNoticia.all

SELECT "tipo_noticias".* FROM "tipo_noticias"
---
  def new
    @noticia = Noticia.new
    @tipoNoticias = TipoNoticia.all

SELECT "tipo_noticias".* FROM "tipo_noticias"
---
  def edit
    @tipoNoticias = TipoNoticia.all

INSERT INTO "noticias" ("titulo", "descripcion", "tipo_noticia_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @noticia = Noticia.new(noticia_params)

    respond_to do |format|
      if @noticia.save

SELECT  "tipo_noticias".* FROM "tipo_noticias" WHERE "tipo_noticias"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_noticia
      @noticia = Noticia.find(params[:id])