app/controllers/preguntas_controller.rb

  def index
    @preguntas = Pregunta.all
---
SELECT "preguntas".* FROM "preguntas"

  def new
    @pregunta = Pregunta.new
    @tipoPreguntas = TipoPregunta.all
---
SELECT "tipo_preguntas".* FROM "tipo_preguntas"

  def create
    @pregunta = Pregunta.new(pregunta_params)

    respond_to do |format|
      if @pregunta.save
---
INSERT INTO "preguntas" ("titulo", "descripcion", "respuesta", "tipo_pregunta_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def set_pregunta
      @pregunta = Pregunta.find(params[:id])
---
SELECT  "tipo_preguntas".* FROM "tipo_preguntas" WHERE "tipo_preguntas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]