app/controllers/servicios_controller.rb

SELECT "servicios".* FROM "servicios"
---
  def index
    @servicios = Servicio.all

SELECT "tipo_servicios".* FROM "tipo_servicios"
SELECT "especialistas".* FROM "especialistas"
---
  def new
    @servicio = Servicio.new
    @tipo_servicios = TipoServicio.all
    @ubicaciones = Ubicacion.all
    @especialistas = Especialista.all

INSERT INTO "servicios" ("descripcion", "ubicacion_id", "tipo_servicio_id", "especialista_id", "precio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @servicio = Servicio.new(servicio_params)

    respond_to do |format|
      if @servicio.save

SELECT  "tipo_servicios".* FROM "tipo_servicios" WHERE "tipo_servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_servicio
      @servicio = Servicio.find(params[:id])