app/controllers/tipo_preguntas_controller.rb

  def index
    @parametros = TipoPregunta.all
---
SELECT "tipo_preguntas".* FROM "tipo_preguntas"

  def show
    @parametro = TipoPregunta.find(params[:id])
---
SELECT  "tipo_preguntas".* FROM "tipo_preguntas" WHERE "tipo_preguntas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @tipo_pregunta = TipoPregunta.new(tipo_pregunta_params)

    respond_to do |format|
      if @tipo_pregunta.save
---
INSERT INTO "tipo_preguntas" ("descripcion", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descripcion", "Pregunta prueba"], ["created_at", 2017-02-26 23:49:00 UTC], ["updated_at", 2017-02-26 23:49:00 UTC]]