app/controllers/tipo_servicios_controller.rb

SELECT "tipo_servicios".* FROM "tipo_servicios"
---
  def index
    @tipo_servicios = TipoServicio.all

SELECT "categorias".* FROM "categorias"
SELECT "cirugias".* FROM "cirugias"
SELECT "grupo_sanguineos".* FROM "grupo_sanguineos"
SELECT "habitos".* FROM "habitos"
SELECT "patologias".* FROM "patologias"
SELECT "sexos".* FROM "sexos"
SELECT "vacunas".* FROM "vacunas"
---
  def new
    @tipo_servicio = TipoServicio.new
    @tipos_atencion = TipoAtencion.all
    @especialidades = Especialidad.all
    @categorias = Categoria.all

    @adicciones = Adiccion.all
    @cirugias = Cirugia.all
    @discapacidades = Discapacidad.all
    @estado_civiles = EstadoCivil.all
    @grupo_sanguineos = GrupoSanguineo.all
    @habitos = Habito.all
    @lesiones = Lesion.all
    @ocupaciones = Ocupacion.all
    @patologias = Patologia.all
    @profesiones = Profesion.all
    @sexos = Sexo.all
    @vacunas = Vacuna.all

INSERT INTO "tipo_servicios" ("descripcion", "texto", "foto_file_name", "foto_content_type", "foto_file_size", "foto_updated_at", "categoria_id", "especialidad_id", "tipo_atencion_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @tipo_servicio = TipoServicio.new(tipo_servicio_params)
    @tipo_servicio.adiccionesTipoServicio = params[:adicciones]
    @tipo_servicio.cirugiasTipoServicio = params[:cirugias]
    @tipo_servicio.discapacidadesTipoServicio = params[:discapacidades]
    @tipo_servicio.estadoCivilesTipoServicio = params[:estado_civiles]
    @tipo_servicio.grupoSanguineosTipoServicio = params[:grupo_sanguineos]
    @tipo_servicio.habitosTipoServicio = params[:habitos]
    @tipo_servicio.lesionesTipoServicio = params[:lesiones]
    @tipo_servicio.ocupacionesTipoServicio = params[:ocupaciones]
    @tipo_servicio.patologiasTipoServicio = params[:patologias]
    @tipo_servicio.profesionesTipoServicio = params[:profesiones]
    @tipo_servicio.sexosTipoServicio = params[:sexos]
    @tipo_servicio.vacunasTipoServicio = params[:vacunas]

    @tipo_servicio.rangoEdadesTipoServicio = params[:rango_edades]
    @tipo_servicio.rangoPesosTipoServicio = params[:rango_pesos]


    respond_to do |format|
      if @tipo_servicio.save

SELECT  "tipo_servicios".* FROM "tipo_servicios" WHERE "tipo_servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "adiccion_tipo_servicios".* FROM "adiccion_tipo_servicios" WHERE "adiccion_tipo_servicios"."tipo_servicio_id" = $1  [["tipo_servicio_id", 1]]
SELECT "cirugia_tipo_servicios".* FROM "cirugia_tipo_servicios" WHERE "cirugia_tipo_servicios"."tipo_servicio_id" = $1  [["tipo_servicio_id", 1]]
SELECT "criterio_tipo_servicios".* FROM "criterio_tipo_servicios" WHERE "criterio_tipo_servicios"."tipo_servicio_id" = $1  [["tipo_servicio_id", 1]]
---
    def set_tipo_servicio
      @tipo_servicio = TipoServicio.find(params[:id])