app/controllers/tipo_noticias_controller.rb

  def index
    @parametros = TipoNoticia.all
---
SELECT "tipo_noticias".* FROM "tipo_noticias"

  def show
    @parametro = TipoNoticia.find(params[:id])
---
SELECT  "tipo_noticias".* FROM "tipo_noticias" WHERE "tipo_noticias"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @parametro = TipoNoticia.find(params[:id])
---
SELECT  "tipo_noticias".* FROM "tipo_noticias" WHERE "tipo_noticias"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @tipo_noticia = TipoNoticia.new(tipo_noticia_params)

    respond_to do |format|
      if @tipo_noticia.save
---
INSERT INTO "tipo_noticias" ("descripcion", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descripcion", "Noticia de web"], ["created_at", 2017-02-26 23:44:22 UTC], ["updated_at", 2017-02-26 23:44:22 UTC]]