app/controllers/turnos_controller.rb

SELECT "turnos".* FROM "turnos"
---
  def index
    @turnos = Turno.all

SELECT "dias".* FROM "dias"
SELECT "horarios".* FROM "horarios"
---
  def new
    @turno = Turno.new
    @dias = Dia.all
    @horarios = Horario.all